app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$dPcSGH1/Cy39KeXyVR3KUeqXyMCinQc7LGZnO0d8gxeJLPpzZXIvq"], ["updated_at", "2015-03-24 02:48:24.133609"], ["id", 104]]
---
  def update
    if password_blank?
      flash.now[:danger] = 'Password can\'t be blank'
      render 'edit'
    elsif @user.update_attributes(user_params)