app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "harrissa23@gmail.com"]]
---
  def create
    logger.info(request.env['omniauth.auth'])
    user = User.from_omniauth(env["omniauth.auth"])
    if user
      session[:user_id] = user.id
      redirect_to root_url
    end

    user = User.find_by(email: params[:session][:email].downcase)