app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    if !current_user.admin? && current_user.id != params[:id]
      redirect_to root_url
    else
      @user = User.find(params[:id])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    p = user_params
    if user_params[:password] != user_params[:password_confirmation]
      flash[:warning] = "Passwords do not match"
      redirect_to(root_url)
      return
    end
    p.delete(:password_confirmation)
    #binding.pry
    @user = User.new(p)

    if @user.save